/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
                                                                    edusya.ino
                                            Copyright © 2020, Zigfred & Nik.S
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
  Arduino ESP-12S ESP8266:
Скетч использует 20508 байт (66%) памяти устройства. Всего доступно 30720 байт.
Глобальные переменные используют 638 байт (31%) динамической памяти, 
оставляя 1410 байт для локальных переменных. Максимум: 2048 байт.
/*****************************************************************************\
Сервер edusya выдает данные:
  аналоговые: 
датчики трансформаторы переменного тока 
датчики перенменного напряжения 
/*****************************************************************************/

//  Блок DEVICE  --------------------------------------------------------------
//  Arduino ATmega328 Nano
#define DEVICE_ID "edusya"
#define VERSION 1

//  Блок libraries  -----------------------------------------------------------
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <WiFiUdp.h>
#include <ArduinoOTA.h>
#include <EmonLib.h>            //  трансформаторы тока pins A1,A2,A3
//                                  flow YF-B5 pin D2

//  Блок settings  ------------------------------------------------------------
#include "boiler_reserve_init.h"

//	end init  -----------------------------------------------------------------


/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            setup
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void setup() {

  Serial.begin(115200);
  Serial.println("Serial.begin(115200)"); 
  
  Serial.print(F("FREE RAM: "));
  Serial.println(freeRam());

  arduinoOTASetup();


}


/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            loop
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void loop() {
  
   ArduinoOTA.handle();
  currentTime = millis();
  realTimeService();
  
  resetWhen30Days();

}
